app/controllers/registrations_controller.rb

    def create
        @user = User.create(
            name: params[:name],
            email: params[:email],
            password: params[:password],
            username: params[:username]
        )
---
INSERT INTO "users" ("name", "username", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)